### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.dits-and-dahs-telegram-bot-api.aws_api_gateway_deployment.stage will be created
+   resource "aws_api_gateway_deployment" "stage" {
+       created_date  = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       rest_api_id   = (known after apply)
+       stage_name    = "1a52da5bc88cf6ea"
    }

  # module.dits-and-dahs-telegram-bot-api.aws_api_gateway_integration.dits_and_dahs_telegram_bot_lambda will be created
+   resource "aws_api_gateway_integration" "dits_and_dahs_telegram_bot_lambda" {
+       cache_namespace         = (known after apply)
+       connection_type         = "INTERNET"
+       http_method             = "POST"
+       id                      = (known after apply)
+       integration_http_method = "POST"
+       passthrough_behavior    = (known after apply)
+       resource_id             = (known after apply)
+       rest_api_id             = (known after apply)
+       timeout_milliseconds    = 29000
+       type                    = "AWS_PROXY"
+       uri                     = (known after apply)
    }

  # module.dits-and-dahs-telegram-bot-api.aws_api_gateway_method.post_updates will be created
+   resource "aws_api_gateway_method" "post_updates" {
+       api_key_required   = false
+       authorization      = "NONE"
+       http_method        = "POST"
+       id                 = (known after apply)
+       request_parameters = {
+           "method.request.header.X-Telegram-Bot-Api-Secret-Token" = true
        }
+       resource_id        = (known after apply)
+       rest_api_id        = (known after apply)
    }

  # module.dits-and-dahs-telegram-bot-api.aws_api_gateway_resource.updates will be created
+   resource "aws_api_gateway_resource" "updates" {
+       id          = (known after apply)
+       parent_id   = (known after apply)
+       path        = (known after apply)
+       path_part   = "updates"
+       rest_api_id = (known after apply)
    }

  # module.dits-and-dahs-telegram-bot-api.aws_api_gateway_rest_api.dits_and_dahs_telegram_bot will be created
+   resource "aws_api_gateway_rest_api" "dits_and_dahs_telegram_bot" {
+       api_key_source               = (known after apply)
+       arn                          = (known after apply)
+       binary_media_types           = (known after apply)
+       created_date                 = (known after apply)
+       description                  = (known after apply)
+       disable_execute_api_endpoint = (known after apply)
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       minimum_compression_size     = (known after apply)
+       name                         = "dits-and-dahs-telegram-bot-1a52da5bc88cf6ea"
+       policy                       = (known after apply)
+       root_resource_id             = (known after apply)
+       tags_all                     = (known after apply)
    }

  # module.dits-and-dahs-telegram-bot-api.aws_iam_role.execute_lambda will be created
+   resource "aws_iam_role" "execute_lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "DitsAndDahsTelegramBotLambdaExecutionRole-1a52da5bc88cf6ea"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.dits-and-dahs-telegram-bot-api.aws_iam_role_policy_attachment.lambda_basic_execution will be created
+   resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+       role       = "DitsAndDahsTelegramBotLambdaExecutionRole-1a52da5bc88cf6ea"
    }

  # module.dits-and-dahs-telegram-bot-api.aws_lambda_function.dits_and_dahs_telegram_bot will be created
+   resource "aws_lambda_function" "dits_and_dahs_telegram_bot" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       filename                       = "files/lambda_function_payload.zip"
+       function_name                  = "dits-and-dahs-telegram-bot-1a52da5bc88cf6ea"
+       handler                        = "provided"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2023"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = "zQaV97O35jqTpItQFuRoW1+0AJu3rjoL7aCYqLKUuus="
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "WEBHOOK_SECRET" = "-"
            }
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>